Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0064GPL020.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2019 Microchip Technology Inc.
 SPDX-License-Identifier: Apache-2.0
 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at
 http://www.apache.org/licenses/LICENSE-2.0
 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->

<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
<file timestamp="2021-04-22T10:23:53Z" />
<variants>
   <variant package="SSOP20" pinout="SSOP20" speedmax="25000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="2" />
   <variant package="QFN20" pinout="QFN20" speedmax="25000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="2" />
</variants>
<pinouts />
<devices>
   <device architecture="MIPS" family="PIC32MM1324" name="PIC32MM0064GPL020" series="PIC32MM">
      <address-spaces>
         <address-space endianness="little" id="base" name="base" size="0x100000000" start="0">
            <memory-segment exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" />
            <memory-segment exec="" name="devid" rw="" size="0x4" start="0xbf803b20" type="" />
            <memory-segment exec="" name="code" rw="" size="0x10000" start="0x1d000000" type="" />
            <memory-segment exec="" name="bootconfig" rw="" size="0x1700" start="0x1fc00000" type="" />
            <memory-segment exec="" name="altconfig" rw="" size="0x28" start="0x1fc01740" type="" />
            <memory-segment exec="" name="kseg0_data_mem" rw="" size="0x2000" start="0x0" type="" />
            <memory-segment exec="" name="periph0" rw="" size="0x8000" start="0x1f800000" type="" />
            <memory-segment exec="" name="periph1" rw="" size="0x8000" start="0x1f808000" type="" />
            <memory-segment exec="" name="UDIDx" rw="" size="0x14" start="0x1FC41840" type="" />
         </address-space>
         <address-space endianness="" id="config" name="config" size="0x28" start="0x1fc017c0" />
      </address-spaces>
      <property-groups>
         <property-group name="SIGNATURES">
            <property name="JTAGID" value="" />
            <property name="CHIPID_CIDR" value="" />
            <property name="CHIPID_EXID" value="" />
         </property-group>
      </property-groups>
      <parameters>
         <param caption="Number of interrupt priority levels" name="__INT_PRIO_LEVELS" value="7" />
         <param caption="Number of interrupt subpriority levels" name="__INT_SUBPRIO_LEVELS" value="4" />
         <param caption="Number of interrupt shadow register sets" name="__INT_NUM_SHADOW_SETS" value="1" />
         <param caption="System Clock Default Frequency" name="__SYS_DEF_FREQ" value="24000000" />
         <param caption="Peripheral Bus Default Clock Frequency" name="__PB_DEF_FREQ" value="24000000" />
         <param caption="Reference Clock 1 Default Clock Frequency" name="__REFCLK1_DEF_FREQ" value="24000000" />
         <param caption="Primary Oscillator Input Default Frequency" name="__POSC_DEF_FREQ" value="8000000" />
         <param caption="Secondary Oscillator Input Default Frequency" name="__SOSC_DEF_FREQ" value="32768" />
         <param caption="Peripheral Bus Default Divider Value" name="__PB_DEF_DIV" value="1" />
         <param caption="Number of DMA Channels" name="__NUM_DMA_CHANNELS" value="0" />
         <param caption="Number of Comparator Channels" name="__NUM_CMP_CHANNELS" value="2" />
         <param caption="DAC resolution in bits" name="__DAC_RESOLUTION" value="5" />
         <param caption="Number of ADC Pins" name="__NUM_ADC_PINS" value="11" />
      </parameters>
      <peripherals>
         <module id="02805" name="ADC" version="">
            <instance name="ADC">
               <register-group address-space="periph0" name="ADC" name-in-module="ADC" offset="0x1f800700" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01512" name="CCP" version="">
            <instance name="CCP1">
               <register-group address-space="periph0" name="CCP" name-in-module="CCP" offset="0x1f800100" />
               <parameters>
                  <param name="MCCP_PRESENT" value="1" caption="Extended PWM features" />
               </parameters>
            </instance>
            <instance name="CCP2">
               <parameters>
                  <param name="MCCP_PRESENT" value="0" caption="Extended PWM features" />
               </parameters>
            </instance>
            <instance name="CCP3">
               <parameters>
                  <param name="MCCP_PRESENT" value="0" caption="Extended PWM features" />
               </parameters>
            </instance>
         </module>
         <module id="01445" name="CDAC" version="">
            <instance name="CDAC1">
               <register-group address-space="periph0" name="CDAC" name-in-module="CDAC" offset="0x1f800980" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02610" name="CFG" version="">
            <instance name="CFG">
               <register-group address-space="periph0" name="CFG" name-in-module="CFG" offset="0x1f802300" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01577" name="CLC" version="">
            <instance name="CLC1">
               <register-group address-space="periph0" name="CLC" name-in-module="CLC" offset="0x1f800a80" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="CLC2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01427" name="CMP" version="">
            <instance name="CMP">
               <register-group address-space="periph0" name="CMP" name-in-module="CMP" offset="0x1f800900" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
