Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0064GPL020.atdf
         <module id="00000" name="CORE" version="">
            <instance name="CORE">
               <register-group address-space="" name="CORE" name-in-module="CORE" offset="0x0" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02672" name="CRC" version="">
            <instance name="CRC">
               <register-group address-space="periph0" name="CRC" name-in-module="CRC" offset="0x1f800a00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02823" name="CRU" version="">
            <instance name="CRU">
               <register-group address-space="periph0" name="CRU" name-in-module="CRU" offset="0x1f802000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02610" name="FUSECONFIG" version="">
            <instance name="FUSECONFIG">
               <register-group address-space="config" name="FUSECONFIG" name-in-module="FUSECONFIG" offset="0x1fc017c0" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02610" name="GPIO" version="">
            <instance name="GPIO">
               <register-group address-space="periph0" name="GPIO" name-in-module="GPIO" offset="0x1f802300" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02511" name="HLVD" version="">
            <instance name="HLVD">
               <register-group address-space="periph0" name="HLVD" name-in-module="HLVD" offset="0x1f802310" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02610" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph0" name="INT" name-in-module="INT" offset="0x1f802300" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02695" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph0" name="NVM" name-in-module="NVM" offset="0x1f802380" />
               <parameters>
                  <param name="PAGE_SIZE" value="2048" />
                  <param name="ROW_SIZE" value="256" />
               </parameters>
            </instance>
         </module>
         <module id="02823" name="RCON" version="">
            <instance name="RCON">
               <register-group address-space="periph0" name="RCON" name-in-module="RCON" offset="0x1f802000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02050" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph0" name="RTCC" name-in-module="RTCC" offset="0x1f800000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph1" name="SPI" name-in-module="SPI" offset="0x1f808080" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02141" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph1" name="TMR1" name-in-module="TMR1" offset="0x1f808000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02478" name="UART" version="">
            <instance name="UART1">
               <register-group address-space="periph0" name="UART" name-in-module="UART" offset="0x1f800600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="UART2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02610" name="UDID" version="">
            <instance name="UDID">
               <register-group address-space="UDIDx" name="UDID" name-in-module="UDID" offset="0x1fc41840" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02674" name="WDT" version="">
            <instance name="WDT">
               <register-group address-space="periph0" name="WDT" name-in-module="WDT" offset="0x1f803e80" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
      </peripherals>
      <interrupts>
         <interrupt caption="Core Timer" index="0" name="CORE_TIMER" />
         <interrupt caption="Core Software 0" index="1" name="CORE_SOFTWARE_0" />
         <interrupt caption="Core Software 1" index="2" name="CORE_SOFTWARE_1" />
         <interrupt caption="External 0" index="3" name="EXTERNAL_0" />
         <interrupt caption="External 1" index="4" name="EXTERNAL_1" />
         <interrupt caption="External 2" index="5" name="EXTERNAL_2" />
         <interrupt caption="External 3" index="6" name="EXTERNAL_3" />
         <interrupt caption="External 4" index="7" name="EXTERNAL_4" />
         <interrupt caption="PORT A Change Notification" index="8" name="CHANGE_NOTICE_A" />
         <interrupt caption="PORT B Change Notification" index="9" name="CHANGE_NOTICE_B" />
         <interrupt caption="PORT C Change Notification" index="10" name="CHANGE_NOTICE_C" />
         <interrupt caption="Timer 1" index="11" name="TIMER_1" />
         <interrupt caption="Comparator 1" index="12" name="COMPARATOR_1" />
         <interrupt caption="Comparator 2" index="13" name="COMPARATOR_2" />
         <interrupt caption="Real Time Clock Alarm" index="14" name="RTCC" />
         <interrupt caption="ADC Conversion Done" index="15" name="ADC" />
         <interrupt caption="CRC" index="16" name="CRC" />
         <interrupt caption="HLVD" index="17" name="HLVD" />
         <interrupt caption="Logic Cell 1" index="18" name="CLC1" />
         <interrupt caption="Logic Cell 2" index="19" name="CLC2" />
         <interrupt caption="SPI 1 Error" index="20" name="SPI1_ERR" />
         <interrupt caption="SPI 1 Transmission" index="21" name="SPI1_TX" />
         <interrupt caption="SPI 1 Reception" index="22" name="SPI1_RX" />
         <interrupt caption="UART 1 Reception" index="23" name="UART1_RX" />
         <interrupt caption="UART 1 Transmission" index="24" name="UART1_TX" />
         <interrupt caption="UART 1 Error" index="25" name="UART1_ERR" />
         <interrupt caption="CCP 1 Input Capture or Output Compare" index="29" name="CCP1" />
         <interrupt caption="CCP 1 Timer" index="30" name="CCT1" />
         <interrupt caption="CCP 2 Input Capture or Output Compare" index="31" name="CCP2" />
         <interrupt caption="CCP 2 Timer" index="32" name="CCT2" />
         <interrupt caption="CCP 3 Input Capture or Output Compare" index="33" name="CCP3" />
         <interrupt caption="CCP 3 Timer" index="34" name="CCT3" />
         <interrupt caption="SPI 2 Error" index="37" name="SPI2_ERR" />
         <interrupt caption="SPI 2 Transmission" index="38" name="SPI2_TX" />
         <interrupt caption="SPI 2 Reception" index="39" name="SPI2_RX" />
         <interrupt caption="UART 2 Reception" index="40" name="UART2_RX" />
         <interrupt caption="UART 2 Transmission" index="41" name="UART2_TX" />
         <interrupt caption="UART 2 Error" index="42" name="UART2_ERR" />
         <interrupt caption="NVM Program or Erase Complete" index="46" name="NVM" />
         <interrupt caption="Core Performance Counter" index="47" name="PERFORMANCE_COUNTER" />
      </interrupts>
      <interfaces>
         <interface name="JTAG" type="samjtag" />
         <interface name="SWD" type="swd" />
      </interfaces>
   </device>
</devices>
<modules>
   <module caption="" id="02805" name="ADC" version="">
      <register-group name="ADC">
         <register caption="" name="ADC1BUF0" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF0" />
         </register>
