Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0064GPL020.atdf
         <register caption="" name="RPOR0" offset="0x290" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="RP1R" />
            <bitfield caption="" mask="0x00000F00" name="RP2R" />
            <bitfield caption="" mask="0x000F0000" name="RP3R" />
            <bitfield caption="" mask="0x0F000000" name="RP4R" />
         </register>
         <register caption="" name="RPOR1" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="RP5R" />
            <bitfield caption="" mask="0x00000F00" name="RP6R" />
            <bitfield caption="" mask="0x000F0000" name="RP7R" />
            <bitfield caption="" mask="0x0F000000" name="RP8R" />
         </register>
         <register caption="" name="RPOR2" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="RP9R" />
            <bitfield caption="" mask="0x00000F00" name="RP10R" />
            <bitfield caption="" mask="0x000F0000" name="RP11R" />
            <bitfield caption="" mask="0x0F000000" name="RP12R" />
         </register>
         <register caption="" name="RPOR3" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="RP13R" />
            <bitfield caption="" mask="0x00000F00" name="RP14R" />
            <bitfield caption="" mask="0x000F0000" name="RP15R" />
            <bitfield caption="" mask="0x0F000000" name="RP16R" />
         </register>
         <register caption="" name="RPOR4" offset="0x2d0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="RP17R" />
            <bitfield caption="" mask="0x00000F00" name="RP18R" />
            <bitfield caption="" mask="0x000F0000" name="RP19R" />
            <bitfield caption="" mask="0x0F000000" name="RP20R" />
         </register>
         <register caption="" name="ANSELA" offset="0x300" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ANSELA" />
            <bitfield caption="" mask="0x00000002" name="ANSELA" />
            <bitfield caption="" mask="0x00000004" name="ANSELA" />
            <bitfield caption="" mask="0x00000008" name="ANSELA" />
         </register>
         <register caption="" name="ANSELB" offset="0x400" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ANSELB" />
            <bitfield caption="" mask="0x00000002" name="ANSELB" />
            <bitfield caption="" mask="0x00000004" name="ANSELB" />
            <bitfield caption="" mask="0x00001000" name="ANSELB" />
            <bitfield caption="" mask="0x00002000" name="ANSELB" />
            <bitfield caption="" mask="0x00004000" name="ANSELB" />
            <bitfield caption="" mask="0x00008000" name="ANSELB" />
         </register>
         <register caption="" name="TRISA" offset="0x310" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISA" />
            <bitfield caption="" mask="0x00000002" name="TRISA" />
            <bitfield caption="" mask="0x00000004" name="TRISA" />
            <bitfield caption="" mask="0x00000008" name="TRISA" />
            <bitfield caption="" mask="0x00000010" name="TRISA" />
         </register>
         <register caption="" name="TRISB" offset="0x410" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISB" />
            <bitfield caption="" mask="0x00000002" name="TRISB" />
            <bitfield caption="" mask="0x00000004" name="TRISB" />
            <bitfield caption="" mask="0x00000010" name="TRISB" />
            <bitfield caption="" mask="0x00000080" name="TRISB" />
            <bitfield caption="" mask="0x00000100" name="TRISB" />
            <bitfield caption="" mask="0x00000200" name="TRISB" />
            <bitfield caption="" mask="0x00001000" name="TRISB" />
            <bitfield caption="" mask="0x00002000" name="TRISB" />
            <bitfield caption="" mask="0x00004000" name="TRISB" />
            <bitfield caption="" mask="0x00008000" name="TRISB" />
         </register>
         <register caption="" name="PORTA" offset="0x320" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="PORTA" />
            <bitfield caption="" mask="0x00000002" name="PORTA" />
            <bitfield caption="" mask="0x00000004" name="PORTA" />
            <bitfield caption="" mask="0x00000008" name="PORTA" />
            <bitfield caption="" mask="0x00000010" name="PORTA" />
         </register>
         <register caption="" name="PORTB" offset="0x420" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="PORTB" />
            <bitfield caption="" mask="0x00000002" name="PORTB" />
            <bitfield caption="" mask="0x00000004" name="PORTB" />
            <bitfield caption="" mask="0x00000010" name="PORTB" />
            <bitfield caption="" mask="0x00000080" name="PORTB" />
            <bitfield caption="" mask="0x00000100" name="PORTB" />
            <bitfield caption="" mask="0x00000200" name="PORTB" />
            <bitfield caption="" mask="0x00001000" name="PORTB" />
            <bitfield caption="" mask="0x00002000" name="PORTB" />
            <bitfield caption="" mask="0x00004000" name="PORTB" />
            <bitfield caption="" mask="0x00008000" name="PORTB" />
         </register>
         <register caption="" name="LATA" offset="0x330" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATA" />
            <bitfield caption="" mask="0x00000002" name="LATA" />
            <bitfield caption="" mask="0x00000004" name="LATA" />
            <bitfield caption="" mask="0x00000008" name="LATA" />
            <bitfield caption="" mask="0x00000010" name="LATA" />
         </register>
         <register caption="" name="LATB" offset="0x430" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATB" />
            <bitfield caption="" mask="0x00000002" name="LATB" />
            <bitfield caption="" mask="0x00000004" name="LATB" />
            <bitfield caption="" mask="0x00000010" name="LATB" />
            <bitfield caption="" mask="0x00000080" name="LATB" />
            <bitfield caption="" mask="0x00000100" name="LATB" />
            <bitfield caption="" mask="0x00000200" name="LATB" />
            <bitfield caption="" mask="0x00001000" name="LATB" />
            <bitfield caption="" mask="0x00002000" name="LATB" />
            <bitfield caption="" mask="0x00004000" name="LATB" />
            <bitfield caption="" mask="0x00008000" name="LATB" />
         </register>
         <register caption="" name="ODCA" offset="0x340" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCA" />
            <bitfield caption="" mask="0x00000002" name="ODCA" />
            <bitfield caption="" mask="0x00000004" name="ODCA" />
            <bitfield caption="" mask="0x00000008" name="ODCA" />
            <bitfield caption="" mask="0x00000010" name="ODCA" />
         </register>
